"""
โจทย์ 1: เครื่องคำนวณอย่างปลอดภัย
เขียนโปรแกรมรับตัวเลข 2 จำนวนและตัวดำเนินการ 1ตัว ได้แก่ + - * / แล้วแสดงผลลัพธ์
โปรแกรมต้องจัดการกรณีต่อไปนี้
*ผู้ใช้กรอกข้อมูลที่ไม่ใช่ของตัวเลข #ValueError
*ผู้ใช้ เลือกตัวดำเนินการอื่นนอกเหนือจาก + - * / raise ValueError
*ผู้ใช้พยายามหารด้วยศูนย์ #ZeroDivisionError
*โปรแกรมต้องแสดง จบการทำงาน เสมอด้วย finally

ตัวอย่างผลลัพธ์ที่คาดหวัง
ตัวเลขที่ 1: 10
ตัวเลขที่ 2: 0
เครื่องหมาย (+,-,*,/): /

ไม่สามารถหารด้วยด้วยศูนย์ได้
จบการทำงาน

"""

try:
    num1 = float(input("ตัวเลขที่ 1: "))
    num2 = float(input("ตัวเลขที่ 2: "))
    op = input("เครื่องหมาย (+,-,*,/): ").strip()

    if op not in ['+', '-', '*', '/']:
        raise ValueError("เครื่องหมายไม่ถูกต้อง")

    if op == '+':
        result = num1 + num2
    elif op == '-':
        result = num1 - num2
    elif op == '*':
        result = num1 * num2
    elif op == '/':
        result = num1 / num2

    print(f"ผลลัพธ์: {result}")

except ValueError as e:
    if str(e) == "เครื่องหมายไม่ถูกต้อง":
        print("ตัวดำเนินการไม่ถูกต้อง กรุณาใช้เฉพาะ +, -, *, /")
    else:
        print("กรุณากรอกเฉพาะตัวเลขเท่านั้น")

except ZeroDivisionError:
    print("ไม่สามารถหารด้วยด้วยศูนย์ได้")

finally:
    print("จบการทำงาน")